

<!DOCTYPE html>
<html lang="en">
<head prefix="og: http://ogp.me/ns#">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1">
    <meta name="description" content="">
    <title>HTTP | message(status codes) | 372 | scientific thinking</title>

    <!-- Open Graph -->
    <meta name="description" content="&amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1B;&amp;#xC740; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC751;&amp;#xB2F5;&amp;#xD558;&amp;#xB294; &amp;#xBA54;&amp;#xC138;&amp;#xC9C0;&amp;#xC5D0;&amp;#xB294; HTTP &amp;#xC0C1;&amp;#xD0DC; &amp;#xCF54;&amp;#xB4DC; &amp;#xB97C; &amp;#x">
<meta name="keywords" content="http,web,network">
<meta property="og:type" content="article">
<meta property="og:title" content="HTTP | message(status codes)">
<meta property="og:url" content="https://sc372.github.io/2017/06/12/http-message-statuscodes/index.html">
<meta property="og:site_name" content="372 | scientific thinking">
<meta property="og:description" content="&amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1B;&amp;#xC740; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC751;&amp;#xB2F5;&amp;#xD558;&amp;#xB294; &amp;#xBA54;&amp;#xC138;&amp;#xC9C0;&amp;#xC5D0;&amp;#xB294; HTTP &amp;#xC0C1;&amp;#xD0DC; &amp;#xCF54;&amp;#xB4DC; &amp;#xB97C; &amp;#x">
<meta property="og:locale" content="en">
<meta property="og:updated_time" content="2017-07-29T05:37:17.870Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="HTTP | message(status codes)">
<meta name="twitter:description" content="&amp;#xC11C;&amp;#xBC84;&amp;#xC5D0;&amp;#xC11C; &amp;#xBC1B;&amp;#xC740; &amp;#xC694;&amp;#xCCAD;&amp;#xC744; &amp;#xC751;&amp;#xB2F5;&amp;#xD558;&amp;#xB294; &amp;#xBA54;&amp;#xC138;&amp;#xC9C0;&amp;#xC5D0;&amp;#xB294; HTTP &amp;#xC0C1;&amp;#xD0DC; &amp;#xCF54;&amp;#xB4DC; &amp;#xB97C; &amp;#x">

    <script type="application/ld+json">
{
  "@context": "http://schema.org",
  "@type": "Person",
  "email": "mailto:",
  "image": "",
  "name": "372",
  "url": "https://sc372.github.io"
}
</script>
    <script>
    var algoliaEnabled = false;
    
</script>

    

    
    
        <link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
    
    
    
        <!-- stylesheets list from config.yml -->
        
        <link rel="stylesheet" href="/css/aloha.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/magnific-popup.js/1.1.0/magnific-popup.min.css">
        
    

</head>
<body id="body" style="margin-bottom: 0;" class="pushable">

    <div class="ui top fixed menu">
        <a class="item" id="menu-icon"><i class="sidebar icon"></i></a>
    </div>

    <div id="menu-sidebar" class="ui left vertical sidebar menu">

    <div id="sidebar-top">
        <div class="content">
            <h3>372 | scientific thinking</h3>
        </div>
    </div>
    <div class="ui container sidebar-card">
    <div class="ui people shape content">
        <div class="active side">
            <div class="ui card">
                <div class="image">
                    <img class="ui medium bordered image" src="/images/avatar.jpg">
                </div>
                <div class="content">
                    <a class="header">372</a>
                    
                        <div class="meta">
                            Programer / Roaster / Sienze
                        </div>
                    
                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                        <div class="item">
                            <i class="marker icon" style="float: left"></i>
                            <div class="content">Asia/Seoul</div>
                        </div>
                        
                        
                    </div>

                </div>
                <div class="extra content">
                    <div class="ui list">
                        

                                <a href="https://github.com/sc372"><i class="large github icon" style="float: left"></i></a>

                            

                                <a href="https://twitter.com/lsc372"><i class="large twitter icon" style="float: left"></i></a>

                            

                                <a href="https://about.me/sc372"><i class="large user icon" style="float: left"></i></a>

                            
                    </div>
                </div>
            </div>
        </div>
    </div>


</div>

    
    

    

    
    <a href="/index.html" class="item" >
        <i class="home icon"></i>
        home
    </a>

    
    

    

    
    <a href="/categories/Web" class="item" >
        <i class=" icon"></i>
        web
    </a>

    
    

    

    
    <a href="/categories/OS" class="item" >
        <i class=" icon"></i>
        os
    </a>

    
    

    

    
    <a href="/categories/FunctionalProgramming" class="item" >
        <i class=" icon"></i>
        functional programming
    </a>

    

    
</div>

    <div class="pusher body-content">
        <div id="content" class="ui main container">
            <!--<div class="ui one column grid">-->
                <!--<div class="column">-->
                    <!--<div class="ui main container">-->
                        <div id="post-http-message-statuscodes" class="ui main container article-type-post">

    

    <div class="ui divided grid">

        <div class="two column row" id="article-content">

            <div class="thirteen wide computer thirteen wide tablet sixteen wide mobile column">
                

<h1 class="ui header">
    
    HTTP | message(status codes)
</h1>



                <div class="article-inner">

                    <div class="article-entry" itemprop="articleBody">
                        
                        <p>&#xC11C;&#xBC84;&#xC5D0;&#xC11C; &#xBC1B;&#xC740; &#xC694;&#xCCAD;&#xC744; &#xC751;&#xB2F5;&#xD558;&#xB294; &#xBA54;&#xC138;&#xC9C0;&#xC5D0;&#xB294; <a href="https://ko.wikipedia.org/wiki/HTTP_%EC%83%81%ED%83%9C_%EC%BD%94%EB%93%9C" target="_blank" rel="external">HTTP &#xC0C1;&#xD0DC; &#xCF54;&#xB4DC;</a> &#xB97C; &#xB2F4;&#xC544;&#xC11C; &#xBCF4;&#xB0C5;&#xB2C8;&#xB2E4;. &#xC0C1;&#xD0DC; &#xCF54;&#xB4DC;&#xC5D0;&#xB294; &#xC694;&#xCCAD;&#xD55C; HTTP &#xC758; &#xC751;&#xB2F5; &#xBA54;&#xC138;&#xC9C0;&#xC778; <strong>&#xC815;&#xBCF4; &#xC751;&#xB2F5;, &#xC131;&#xACF5; &#xC751;&#xB2F5;, &#xB9AC;&#xB2E4;&#xC774;&#xB809;&#xC158; &#xC644;&#xB8CC;, &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xC624;&#xB958;, &#xC11C;&#xBC84; &#xC624;&#xB958;</strong> 5&#xAC00;&#xC9C0; &#xC815;&#xBCF4;&#xB97C; &#xCF54;&#xB4DC;&#xB85C; &#xB098;&#xD0C0;&#xB0C5;&#xB2C8;&#xB2E4;.</p>
<h2 id="100-&#xBC88;&#xB300;-&#xC815;&#xBCF4;-&#xC751;&#xB2F5;-Informational"><a href="#100-&#xBC88;&#xB300;-&#xC815;&#xBCF4;-&#xC751;&#xB2F5;-Informational" class="headerlink" title="100 &#xBC88;&#xB300; : &#xC815;&#xBCF4; &#xC751;&#xB2F5; (Informational)"></a>100 &#xBC88;&#xB300; : &#xC815;&#xBCF4; &#xC751;&#xB2F5; (Informational)</h2><p>100 &#xBC88;&#xB300; &#xCF54;&#xB4DC;&#xB294; &#xC694;&#xCCAD;&#xC744; &#xBC1B;&#xACE0; &#xC788;&#xB294; &#xC0C1;&#xD0DC;&#xC5D0;&#xC11C; &#xCC98;&#xB9AC;&#xB97C; &#xC218;&#xD589;&#xD558;&#xACE0; &#xC788;&#xB294; &#xC911;&#xC774;&#xB77C;&#xB294; &#xAC83;&#xC744; &#xC54C;&#xB9AC;&#xAE30; &#xC704;&#xD55C; &#xCF54;&#xB4DC; &#xC785;&#xB2C8;&#xB2E4;. HTTP/1.1 &#xBC84;&#xC804;&#xC5D0;&#xC11C; &#xACF5;&#xAC1C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul class="ui list">
<li>100 (Continue) : &#xC9C0;&#xAE08;&#xAE4C;&#xC9C0;&#xC758; &#xC694;&#xCCAD;&#xC744; &#xC131;&#xACF5;&#xC801;&#xC73C;&#xB85C; &#xC218;&#xD589;&#xB418;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xC751;&#xB2F5;&#xC785;&#xB2C8;&#xB2E4;. &#xBCF8;&#xBB38; &#xB0B4;&#xC6A9;&#xC744; &#xBCF4;&#xB0B4;&#xB3C4; &#xC720;&#xD6A8;&#xD558;&#xB2E4;&#xB294; &#xD45C;&#xD604;&#xC774;&#xBA70; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C;&#xB294; &#xBB34;&#xC2DC;&#xD558;&#xACE0; &#xC791;&#xC5C5;&#xC744; &#xC774;&#xC5B4;&#xB098;&#xAC00;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</li>
<li>101 (Switching Protocol) : &#xC11C;&#xBC84;&#xAC00; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC744; &#xBC14;&#xAFB8;&#xC5C8;&#xB2E4;&#xB294; &#xC751;&#xB2F5; &#xCF54;&#xB4DC; &#xC785;&#xB2C8;&#xB2E4;.</li>
</ul>
<h2 id="200-&#xBC88;&#xB300;-&#xC131;&#xACF5;-&#xC751;&#xB2F5;-Success"><a href="#200-&#xBC88;&#xB300;-&#xC131;&#xACF5;-&#xC751;&#xB2F5;-Success" class="headerlink" title="200 &#xBC88;&#xB300; : &#xC131;&#xACF5; &#xC751;&#xB2F5; (Success)"></a>200 &#xBC88;&#xB300; : &#xC131;&#xACF5; &#xC751;&#xB2F5; (Success)</h2><p>200 &#xBC88;&#xB300; &#xCF54;&#xB4DC;&#xB294; &#xC694;&#xCCAD;&#xC744; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xCC98;&#xB9AC; &#xB418;&#xC5C8;&#xC744; &#xB584; &#xBC18;&#xD658;&#xB418;&#xB294; &#xCF54;&#xB4DC; &#xC785;&#xB2C8;&#xB2E4;.</p>
<ul class="ui list">
<li>200 (OK) : &#xC694;&#xCCAD;&#xC5D0; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xCC98;&#xB9AC; &#xB418;&#xC5C8;&#xB2E4;&#xB294; &#xCF54;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;.</li>
<li>201 (Created) : &#xBCF4;&#xD1B5; <code>PUT</code> &#xC694;&#xCCAD; &#xC774;&#xD6C4;&#xC5D0; &#xB098;&#xC624;&#xB294; &#xCF54;&#xB4DC;&#xB85C;&#xC11C; &#xC0C8;&#xB85C;&#xC6B4; &#xB9AC;&#xC18C;&#xC2A4;&#xAC00; &#xC0DD;&#xC131;&#xB418;&#xC5C8;&#xC74C;&#xC744; &#xC54C;&#xB9AC;&#xB294; &#xCF54;&#xB4DC; &#xC785;&#xB2C8;&#xB2E4;.(&#xB9AC;&#xC18C;&#xC2A4;&#xC758; &#xAD6C;&#xCCB4;&#xC801; &#xC815;&#xBCF4;&#xC640; &#xD568;&#xAED8;)</li>
<li>202 (Accepted) : &#xC694;&#xCCAD;&#xC740; &#xBC1B;&#xC544;&#xB4E4;&#xC5EC; &#xC84C;&#xC73C;&#xB098; &#xC11C;&#xBC84;&#xB294; &#xC5B4;&#xB5A4; &#xB3D9;&#xC791;&#xC744; &#xD558;&#xC9C0; &#xC54A;&#xC558;&#xC744; &#xACBD;&#xC6B0; &#xC785;&#xB2C8;&#xB2E4;.</li>
<li>203 (Non-Authoritative Information) : &#xC11C;&#xBC84;&#xAC00; &#xC694;&#xCCAD;&#xC744; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xCC98;&#xB9AC; &#xB418;&#xC5C8;&#xC73C;&#xB098; &#xB9AC;&#xC18C;&#xC2A4;&#xC758; &#xBA54;&#xD0C0;&#xC815;&#xBCF4;&#xB97C; &#xAC80;&#xC99D;&#xD558;&#xC9C0; &#xC54A;&#xC740; &#xC0AC;&#xBCF8;&#xC77C; &#xC218; &#xC788;&#xB294; &#xB9AC;&#xC18C;&#xC2A4;&#xB97C; &#xBCF4;&#xC5EC;&#xC904; &#xACBD;&#xC6B0; &#xC785;&#xB2C8;&#xB2E4;.</li>
<li>204 (No Content) : &#xBCF8;&#xBB38;&#xC774; &#xC5C6;&#xB294; &#xACBD;&#xC6B0; &#xC785;&#xB2C8;&#xB2E4;. &#xC8FC;&#xB85C; &#xC0C8; &#xBB38;&#xC11C;&#xB85C; &#xC774;&#xB3D9;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xC0C8;&#xB85C;&#xACE0;&#xCE68;&#xD560; &#xB584; &#xB098;&#xD0C0;&#xB0A9;&#xB2C8;&#xB2E4;.</li>
<li>205 (Reset Content) : html &#xD3FC; &#xB0B4;&#xBD80;&#xC758; &#xAC12;&#xC744; &#xBAA8;&#xB450; &#xBE44;&#xC6CC;&#xC9C4;&#xB2E4;&#xB294; &#xB0B4;&#xC6A9;&#xC785;&#xB2C8;&#xB2E4;. &#xD604;&#xC7AC; &#xBB38;&#xC11C;&#xB97C; &#xCD08;&#xAE30;&#xD654; &#xD569;&#xB2C8;&#xB2E4;.</li>
<li>206 (Partial Content) : &#xC5B4;&#xB5A4; &#xD55C; &#xBD80;&#xBD84;&#xC774;&#xB098; &#xC77C;&#xBD80;&#xB97C; &#xC9C0;&#xC815;&#xD55C; &#xC694;&#xCCAD;&#xC5D0; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xCC98;&#xB9AC; &#xB418;&#xC5C8;&#xC744; &#xB54C; &#xC785;&#xB2C8;&#xB2E4;. Content-Range &#xC640; Date &#xD5E4;&#xB354;&#xB97C; &#xBC18;&#xB4DC;&#xC2DC; &#xD3EC;&#xD568; &#xD574;&#xC57C; &#xD558;&#xBA70; Etag &#xC640; Content-Location &#xC911; &#xD558;&#xB098;&#xC758; &#xD5E4;&#xB354;&#xB3C4; &#xBC18;&#xB4DC;&#xC2DC; &#xD3EC;&#xD568;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
<h2 id="300-&#xBC88;&#xB300;-&#xB9AC;&#xB2E4;&#xC774;&#xB809;&#xC158;-&#xC644;&#xB8CC;"><a href="#300-&#xBC88;&#xB300;-&#xB9AC;&#xB2E4;&#xC774;&#xB809;&#xC158;-&#xC644;&#xB8CC;" class="headerlink" title="300 &#xBC88;&#xB300; : &#xB9AC;&#xB2E4;&#xC774;&#xB809;&#xC158; &#xC644;&#xB8CC;"></a>300 &#xBC88;&#xB300; : &#xB9AC;&#xB2E4;&#xC774;&#xB809;&#xC158; &#xC644;&#xB8CC;</h2><p>300 &#xBC88;&#xB300; &#xCF54;&#xB4DC;&#xB294; &#xB9AC;&#xB2E4;&#xC774;&#xB809;&#xC158;&#xC774; &#xB418;&#xC5C8;&#xB2E4;&#xB294; &#xCF54;&#xB4DC;&#xB85C;&#xC11C; &#xC694;&#xCCAD;&#xD55C; &#xB9AC;&#xC18C;&#xC2A4;&#xC5D0; &#xB300;&#xD574; &#xB2E4;&#xB978; &#xC704;&#xCE58;&#xC5D0; &#xC788;&#xB2E4;&#xB294; &#xC815;&#xBCF4;(location &#xD5E4;&#xB354; &#xC815;&#xBCF4;)&#xB97C; &#xC8FC;&#xAC70;&#xB098; &#xB2E4;&#xB978; &#xB300;&#xC548;&#xC744; &#xC904; &#xACBD;&#xC6B0; &#xC785;&#xB2C8;&#xB2E4;.</p>
<ul class="ui list">
<li>300 (Multiple Choice) : &#xC694;&#xCCAD; &#xB0B4;&#xC6A9;&#xC5D0; &#xB3D9;&#xC2DC;&#xC5D0; &#xC5EC;&#xB7EC; &#xB9AC;&#xC18C;&#xC2A4;&#xB97C; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; URL &#xC77C; &#xACBD;&#xC6B0;&#xC5D0; &#xB098;&#xD0C0;&#xB0A9;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC6A9;&#xC790;&#xB294; &#xBC18;&#xD658;&#xB418;&#xB294; &#xBAA9;&#xB85D;&#xC5D0;&#xC11C; &#xD558;&#xB098;&#xB97C; &#xC120;&#xD0DD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>301 (Moved Permanently) : &#xC694;&#xCCAD;&#xD55C; URL &#xC774; &#xC62E;&#xACA8; &#xC84C;&#xC744; &#xACBD;&#xC6B0; &#xC785;&#xB2C8;&#xB2E4;. &#xC62E;&#xACA8;&#xC9C4; URL &#xC744; &#xC54C;&#xB824;&#xC90D;&#xB2C8;&#xB2E4;.</li>
<li>302 (Found) : &#xC694;&#xCCAD;&#xD55C; URL &#xB294; &#xC784;&#xC2DC;&#xC801;&#xC73C;&#xB85C; &#xC0C8;&#xB85C;&#xC6B4; URL &#xC774; &#xB098;&#xD0C0;&#xB0A9;&#xB2C8;&#xB2E4;. &#xC774;&#xD6C4;&#xC5D0;&#xB294; &#xC6D0;&#xB798; URL &#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>303 (See Other) : &#xC694;&#xCCAD;&#xC5D0; &#xB300;&#xD55C; &#xB9AC;&#xC18C;&#xC2A4;&#xAC00; &#xB2E4;&#xB978; URL &#xC5D0; &#xC788;&#xB2E4;&#xACE0; &#xC54C;&#xB824;&#xC8FC;&#xB294; &#xBA54;&#xC138;&#xC9C0; &#xC785;&#xB2C8;&#xB2E4;. &#xC8FC;&#xB85C; POST &#xC5D0; &#xB300;&#xD55C; &#xC751;&#xB2F5;&#xC73C;&#xB85C;&#xC11C; GET &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xB9AC;&#xC18C;&#xC2A4;&#xB97C; &#xC5BB;&#xC5B4;&#xC57C; &#xD55C;&#xB2E4;&#xACE0; &#xC54C;&#xB824;&#xC8FC;&#xB294; &#xBA54;&#xC138;&#xC9C0; &#xC785;&#xB2C8;&#xB2E4;. </li>
<li>304 (Not Modified) : &#xC694;&#xCCAD;&#xD55C; &#xB9AC;&#xC18C;&#xC2A4;&#xAC00; &#xB9C8;&#xC9C0;&#xB9C9; &#xC694;&#xCCAD; &#xC774;&#xD6C4; &#xBCC0;&#xACBD;&#xB41C; &#xC801;&#xC774; &#xC5C6;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xCE90;&#xC2DC; &#xB9AC;&#xC18C;&#xC2A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB77C;&#xACE0; &#xC54C;&#xB824;&#xC90D;&#xB2C8;&#xB2E4;.</li>
<li>305 (Use Proxy) : &#xD2B9;&#xC815; &#xB9AC;&#xC18C;&#xC2A4;&#xB294; &#xBC18;&#xB4DC;&#xC2DC; &#xD504;&#xB77D;&#xC2DC;&#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xC811;&#xADFC;&#xB418;&#xC5B4;&#xC57C; &#xD568;&#xC744; &#xC54C;&#xB824;&#xC8FC;&#xB294; &#xBA54;&#xC138;&#xC9C0; &#xC785;&#xB2C8;&#xB2E4;.</li>
<li>307 (Temporary Redirect) : &#xC694;&#xCCAD;&#xB41C; &#xB9AC;&#xC18C;&#xC2A4;&#xC758; URL &#xC774; &#xC784;&#xC2DC;&#xB85C; &#xC62E;&#xACA8;&#xC84C;&#xC74C;&#xC744; &#xC54C;&#xB824;&#xC90D;&#xB2C8;&#xB2E4;. &#xC784;&#xC2DC;&#xB85C; &#xC62E;&#xACA8;&#xC9C4; URL &#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB77C;&#xACE0; &#xC54C;&#xB824;&#xC90D;&#xB2C8;&#xB2E4;. &#xC774;&#xD6C4;&#xC5D0;&#xB294; &#xC774;&#xC804; URL &#xC744; &#xC0AC;&#xC6A9;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. </li>
</ul>
<h2 id="400-&#xBC88;&#xB300;-&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;-&#xC624;&#xB958;"><a href="#400-&#xBC88;&#xB300;-&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;-&#xC624;&#xB958;" class="headerlink" title="400 &#xBC88;&#xB300; : &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xC624;&#xB958;"></a>400 &#xBC88;&#xB300; : &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xC624;&#xB958;</h2><p>400 &#xBC88;&#xB300; &#xCF54;&#xB4DC;&#xB294; &#xC11C;&#xBC84;&#xAC00; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xBA54;&#xC138;&#xC9C0;&#xB97C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xC11C; &#xC694;&#xCCAD;&#xD588;&#xC744; &#xACBD;&#xC6B0; &#xB098;&#xD0C0;&#xB0A9;&#xB2C8;&#xB2E4;.</p>
<ul class="ui list">
<li>400 (Bad Request) : &#xC694;&#xCCAD;&#xC5D0; &#xBB38;&#xBC95;&#xC801; &#xC624;&#xB958;&#xAC00; &#xC788;&#xC74C;&#xC744; &#xC54C;&#xB824;&#xC90D;&#xB2C8;&#xB2E4;.</li>
<li>401 (Unauthorized) : &#xB9AC;&#xC18C;&#xC2A4;&#xB97C; &#xC5BB;&#xAE30; &#xC804;&#xC5D0; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xAC8C; &#xC778;&#xC99D;&#xC744; &#xC694;&#xAD6C;&#xD558;&#xB294; &#xBA54;&#xC138;&#xC9C0; &#xC785;&#xB2C8;&#xB2E4;.</li>
<li>402 (Payment Required) : &#xC11C;&#xBC84;&#xC758; &#xC694;&#xCCAD;&#xC744; &#xBC1B;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xBE44;&#xC6A9;&#xC744; &#xC9C0;&#xBD88;&#xD574;&#xC57C; &#xD55C;&#xB2E4;&#xB294; &#xBA54;&#xC138;&#xC9C0; &#xC785;&#xB2C8;&#xB2E4;(&#xC544;&#xC9C1; &#xAD6C;&#xD604;&#xB418;&#xC9C0;&#xB294; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.)</li>
<li>403 (Forbidden) : &#xC694;&#xCCAD;&#xC774; &#xAC70;&#xBD80; &#xB418;&#xC5C8;&#xC74C;&#xC744; &#xC54C;&#xB824;&#xC90D;&#xB2C8;&#xB2E4;. &#xC694;&#xAD6C; &#xAC70;&#xBD80; &#xC0AC;&#xC720;&#xB97C; &#xC54C;&#xB824;&#xC904; &#xC218; &#xC5C6;&#xC744; &#xACBD;&#xC6B0; &#xC4F0;&#xC785;&#xB2C8;&#xB2E4;.</li>
<li>404 (Not Found) : &#xC694;&#xCCAD;&#xD55C; URL &#xC774; &#xC5C6;&#xC74C;&#xC744; &#xC54C;&#xB824;&#xC90D;&#xB2C8;&#xB2E4;.</li>
<li>405 (Method Not Allowed) : &#xC694;&#xCCAD;&#xD55C; URL &#xC5D0; &#xB300;&#xD574; &#xC9C0;&#xC6D0;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xBA54;&#xC11C;&#xB4DC;&#xB85C; &#xC694;&#xCCAD;&#xD588;&#xC74C;&#xC744; &#xC54C;&#xB824;&#xC90D;&#xB2C8;&#xB2E4;. Allow &#xD5E4;&#xB354;&#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xC720;&#xD6A8;&#xD55C; &#xBA54;&#xC11C;&#xB4DC; &#xC815;&#xBCF4;&#xB97C; &#xBCF4;&#xB0B4;&#xC90D;&#xB2C8;&#xB2E4;.</li>
<li>406 (Not Acceptable) : &#xC694;&#xCCAD;&#xD55C; &#xB9AC;&#xC18C;&#xC2A4;&#xB294; &#xC874;&#xC7AC;&#xD558;&#xC9C0;&#xB9CC; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC6D0;&#xD558;&#xB294; &#xD615;&#xC2DD;&#xC774; &#xC544;&#xB2CC; &#xACBD;&#xC6B0; &#xC785;&#xB2C8;&#xB2E4;.</li>
<li>407 (Proxy Authentication Required) : 401 &#xACFC; &#xBE44;&#xC2B7;&#xD558;&#xC9C0;&#xB9CC; &#xD504;&#xB77D;&#xC2DC; &#xC11C;&#xBC84;&#xC5D0;&#xC11C; &#xC778;&#xC99D;&#xC744; &#xD574;&#xC57C; &#xD568;&#xC744; &#xC54C;&#xB9BD;&#xB2C8;&#xB2E4;. </li>
<li>408 (Request Timeout) : &#xC694;&#xCCAD;&#xC744; &#xC644;&#xB8CC;&#xD558;&#xAE30;&#xC5D0; &#xC9C0;&#xC815;&#xD55C; &#xC2DC;&#xAC04;&#xC744; &#xCD08;&#xACFC;&#xD568;&#xC744; &#xC54C;&#xB824;&#xC90D;&#xB2C8;&#xB2E4;. &#xC774;&#xD6C4; &#xC11C;&#xBC84;&#xB294; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB97C; &#xB04A;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>409 (Conflict) : &#xC694;&#xCCAD;&#xC774; &#xCDA9;&#xB3CC;&#xC744; &#xC77C;&#xC73C;&#xD0AC; &#xC218; &#xC788;&#xC74C;&#xC744; &#xC11C;&#xBC84;&#xC5D0;&#xC11C; &#xD310;&#xB2E8;&#xD588;&#xC74C;&#xC744; &#xC54C;&#xB824;&#xC90D;&#xB2C8;&#xB2E4;.</li>
<li>410 (Gone) : &#xC694;&#xCCAD;&#xD55C; &#xB9AC;&#xC18C;&#xC2A4;&#xAC00; &#xACFC;&#xAC70;&#xC5D0; &#xC788;&#xC5C8;&#xC73C;&#xB098; &#xC9C0;&#xAE08;&#xC740; &#xC0AC;&#xB77C;&#xC84C;&#xC74C;&#xC744; &#xC54C;&#xB824;&#xC90D;&#xB2C8;&#xB2E4;.</li>
<li>411 (Length Required) : &#xC694;&#xCCAD; &#xBA54;&#xC138;&#xC9C0;&#xC5D0; Content-Length &#xD5E4;&#xB354;&#xAC00; &#xC788;&#xC5B4;&#xC57C; &#xD568;&#xC744; &#xC694;&#xAD6C;&#xD560; &#xB584; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>412 (Precondition Failed) : &#xC870;&#xAC74;&#xBD80; &#xC694;&#xCCAD;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xADF8; &#xC911; &#xD558;&#xB098;&#xB97C; &#xCC98;&#xB9AC;&#xD558;&#xC9C0; &#xBABB;&#xD588;&#xC744; &#xACBD;&#xC6B0; &#xC785;&#xB2C8;&#xB2E4;. (&#xC870;&#xAC74;&#xBD80; &#xC694;&#xCCAD;&#xC740; Expert &#xD5E4;&#xB354; &#xD3EC;&#xD568;&#xD560; &#xACBD;&#xC6B0;)</li>
<li>413 (Request Entity Too Loarge) : &#xC694;&#xCCAD; &#xBCF8;&#xBB38;&#xC758; &#xD06C;&#xAE30;&#xAC00; &#xC11C;&#xBC84;&#xC758; &#xCC98;&#xB9AC; &#xD55C;&#xACC4;&#xB97C; &#xB118;&#xC740; &#xC694;&#xCCAD;&#xC744; &#xD588;&#xC744; &#xACBD;&#xC6B0; &#xC785;&#xB2C8;&#xB2E4;.</li>
<li>414 (Request URI Too Long) : &#xC694;&#xCCAD; URL &#xAE38;&#xC774;&#xAC00; &#xC11C;&#xBC84;&#xC758; &#xCC98;&#xB9AC; &#xD55C;&#xACC4;&#xB97C; &#xB118;&#xC740; &#xC694;&#xCCAD;&#xC744; &#xD588;&#xC744; &#xACBD;&#xC6B0; &#xC785;&#xB2C8;&#xB2E4;.</li>
<li>415 (Unsupported Media Type) : &#xC694;&#xCCAD; &#xBCF8;&#xBB38;&#xC758; &#xB0B4;&#xC6A9;&#xC774; &#xC11C;&#xBC84;&#xAC00; &#xC9C0;&#xC6D0;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xD615;&#xC2DD;&#xC77C; &#xACBD;&#xC6B0; &#xC785;&#xB2C8;&#xB2E4;.</li>
<li>416 (Requested Range Not Satisfiable) : &#xC694;&#xCCAD; &#xB0B4;&#xC6A9;&#xC774; &#xB9AC;&#xC18C;&#xC2A4;&#xC758; &#xD2B9;&#xC815; &#xBC94;&#xC704;&#xC778;&#xB370;, &#xBC94;&#xC704;&#xB0B4; &#xB0B4;&#xC6A9;&#xC774; &#xD2C0;&#xB838;&#xC744; &#xACBD;&#xC6B0; &#xC785;&#xB2C8;&#xB2E4;.</li>
<li>417 (Expectation Failed) : &#xC694;&#xCCAD; &#xB0B4;&#xC6A9; &#xC911; Expect &#xD5E4;&#xB354;&#xC5D0;&#xC11C; &#xBA85;&#xC2DC;&#xB41C; &#xC870;&#xAC74;&#xC774; &#xB9CC;&#xC871;&#xB420; &#xC218; &#xC5C6;&#xB294; &#xACBD;&#xC6B0; &#xC785;&#xB2C8;&#xB2E4;.</li>
</ul>
<h2 id="500-&#xBC88;&#xB300;-&#xC11C;&#xBC84;-&#xC624;&#xB958;"><a href="#500-&#xBC88;&#xB300;-&#xC11C;&#xBC84;-&#xC624;&#xB958;" class="headerlink" title="500 &#xBC88;&#xB300; : &#xC11C;&#xBC84; &#xC624;&#xB958;"></a>500 &#xBC88;&#xB300; : &#xC11C;&#xBC84; &#xC624;&#xB958;</h2><p>500 &#xBC88;&#xB300; &#xCF54;&#xB4DC;&#xB294; &#xC62C;&#xBC14;&#xB978; &#xC694;&#xCCAD;&#xC774;&#xC5C8;&#xB294;&#xB370; &#xC11C;&#xBC84; &#xC790;&#xCCB4;&#xC5D0;&#xC11C; &#xC5D0;&#xB7EC;&#xAC00; &#xBC1C;&#xC0DD;&#xD55C; &#xACBD;&#xC6B0; &#xB098;&#xD0C0;&#xB0A9;&#xB2C8;&#xB2E4;.</p>
<ul class="ui list">
<li>500 (Internal Server Error) : &#xC11C;&#xBC84;&#xAC00; &#xBA48;&#xCD94;&#xC5C8;&#xAC70;&#xB098; &#xC124;&#xC815;&#xC5D0;&#xC11C; &#xC624;&#xB958;&#xAC00; &#xB098;&#xD0C0;&#xB0AC;&#xC744; &#xACBD;&#xC6B0; &#xC785;&#xB2C8;&#xB2E4;.</li>
<li>501 (Not Implemented) : &#xC694;&#xCCAD;&#xC774; &#xC11C;&#xBC84;&#xC758; &#xB2A5;&#xB825;&#xC744; &#xB118;&#xC5C8;&#xC744; &#xACBD;&#xC6B0; &#xC785;&#xB2C8;&#xB2E4;. </li>
<li>502 (Bad Gateway) : &#xAC8C;&#xC774;&#xD2B8;&#xC6E8;&#xC774;&#xB098; &#xD504;&#xB77D;&#xC2DC; &#xC5ED;&#xD560;&#xC744; &#xC218;&#xD589;&#xD558;&#xB294; &#xC11C;&#xBC84;&#xAC00; &#xC694;&#xAD6C;&#xB97C; &#xC644;&#xB8CC;&#xD558;&#xB824;&#xB294; &#xC2DC;&#xB3C4;&#xC5D0; &#xC811;&#xADFC;&#xD55C; &#xC5C5;&#xC2A4;&#xD2B8;&#xB9BC;(upstream) &#xC11C;&#xBC84;&#xB85C;&#xBD80;&#xD130; &#xC5D0;&#xB7EC;&#xB97C; &#xC218;&#xC2E0;&#xD588;&#xC744; &#xACBD;&#xC6B0; &#xC785;&#xB2C8;&#xB2E4;.</li>
<li>503 (Service Unavailable) : &#xD604;&#xC7AC;&#xB294; &#xC694;&#xCCAD;&#xC744; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC5C6;&#xC9C0;&#xB9CC; &#xACE7; &#xBCF5;&#xAD6C;&#xB418;&#xC5B4; &#xCC98;&#xB9AC;&#xAC00; &#xAC00;&#xB2A5;&#xD560; &#xAC83;&#xC785;&#xC744; &#xC54C;&#xB824;&#xC90D;&#xB2C8;&#xB2E4;.</li>
<li>504 (Gateway Timeout) : 408 &#xACFC; &#xAC19;&#xC9C0;&#xB9CC; &#xAC8C;&#xC774;&#xD2B8;&#xC6E8;&#xC774;&#xB098; &#xD504;&#xB77D;&#xC2DC; &#xC11C;&#xBC84;&#xC758; &#xACBD;&#xACFC; &#xC2DC;&#xAC04;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>505 (HTTP Version Not Supported) : &#xC11C;&#xBC84;&#xAC00; &#xC9C0;&#xC6D0;&#xD558;&#xC9C0; &#xC54A;&#xB294; HTTP &#xBC84;&#xC804;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC600;&#xC744; &#xACBD;&#xC6B0; &#xC785;&#xB2C8;&#xB2E4;.</li>
</ul>
<hr>
<p><strong>HTTP &#xD1B5;&#xC2E0;&#xC758; &#xACB0;&#xACFC; &#xCF54;&#xB4DC;&#xB97C; &#xC54C;&#xC544;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC2E4;, &#xB0B4;&#xC6A9;&#xC744; &#xC815;&#xB9AC;&#xD558;&#xBA74;&#xC11C; &#xC544;&#xC9C1; &#xC774;&#xD574;&#xAC00; &#xC548;&#xB418;&#xB294; &#xB0B4;&#xC6A9;&#xB3C4; &#xB9CE;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6F9; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC2DC; &#xC751;&#xB2F5;&#xCF54;&#xB4DC;&#xC5D0; &#xB530;&#xB77C;&#xC11C; &#xC801;&#xC815;&#xD55C; &#xB300;&#xC751;&#xC744; &#xD560; &#xC218; &#xC788;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xD574;&#xC57C; &#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</strong></p>

                        
                    </div>

                    
                    
                    

                    <div class="description post-description">
    <span class="post-description-item">
        <time datetime="2017-06-12T09:09:00.000Z" itemprop="datePublished">2017-06-12</time>

    </span>
    <span class="post-description-item">
        

    <span>
        <i class="tags icon"></i>
    </span>

    
    <span class="ui tiny label">
        <a href="/tags/http/">http</a>
    </span>

    
    <span class="ui tiny label">
        <a href="/tags/web/">web</a>
    </span>

    
    <span class="ui tiny label">
        <a href="/tags/network/">network</a>
    </span>

    

    </span>
</div>

                </div>
                
                <div id="pagination" class="nav-web ui text container pagination">

    <div class="ui stackable two column divided grid container">
        <div class="row">
            <div class="column nav-left">
                

                <a class="ui tiny button disabled"><i class="angle left icon"></i>Previous</a>

                
            </div>
            <div class="column nav-right">
                

                <a href="/2017/06/10/javascript-typeconversion/" class="ui tiny button">
                    
                    Javascript | typeconversion(형 변환)
                    
                    <i class="angle right icon"></i></a>
                
            </div>
        </div>
    </div>

</div>
                
            </div>

            
            <div class="three wide computer three wide tablet column">

                <div class="ui sticky article-toc" id="article-toc">
                    <!-- toc -->
                    <ol class="ui ordered list"><li><a href="#100-번대-정보-응답-Informational"><span>100 번대 : 정보 응답 (Informational)</span></a></li><li><a href="#200-번대-성공-응답-Success"><span>200 번대 : 성공 응답 (Success)</span></a></li><li><a href="#300-번대-리다이렉션-완료"><span>300 번대 : 리다이렉션 완료</span></a></li><li><a href="#400-번대-클라이언트-오류"><span>400 번대 : 클라이언트 오류</span></a></li><li><a href="#500-번대-서버-오류"><span>500 번대 : 서버 오류</span></a></li></ol>
                </div>

            </div>
            

        </div>
    </div>
</div>


<!-- disqus start -->
<div id="disqus_thread"></div>
<script type="text/javascript">

<!-- following code is copied form hexo theme Next, thanks a lot -->

var disqus_shortname = '372s-github-page';
var disqus_identifier = '2017/06/12/http-message-statuscodes/';
var disqus_title = 'HTTP | message(status codes)';

function run_disqus_script(disqus_script) {
	var dsq = document.createElement('script');
	dsq.type = 'text/javascript';
	dsq.async = true;
	dsq.src = '//' + disqus_shortname + '.disqus.com/' + disqus_script;
	(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
}

run_disqus_script('count.js');


var disqus_config = function () {
    this.page.url = disqus_url;
    this.page.identifier = disqus_identifier;
    this.page.title = disqus_title;
};

run_disqus_script('embed.js');




</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
                                
<!-- disqus end -->

                    <!--</div>-->
                <!--</div>-->
            <!--</div>-->
        </div>
        <div class="ui vertical footer segment">
    <div class="ui center aligned container">
        <div class="ui inverted section divider"></div>
        &copy; 2017 <a href="/">372</a>.
        All Rights Reserved.
    </div>
</div>

    </div>




<!-- scripts list from theme config.yml -->

<script src="//cdn.bootcss.com/jquery/3.1.0/jquery.min.js"></script>

<script src="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch/3.18.1/algoliasearch.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch-helper-js/2.13.0/algoliasearch.helper.min.js"></script>

<script src="/js/semantic-ui-algolia.js"></script>

<script src="/js/aloha-events.js"></script>



</body>
</html>
